doc/ex-rule-against-perpetuities-20220929/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-09-29 Thu 15:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>representing the rule against perpetuities</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wong Meng Weng" />
</head>
<body>
<div id="content">
<h1 class="title">representing the rule against perpetuities</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbc0c088">1. Goals</a></li>
<li><a href="#orgf870666">2. Represent the Civil Law Act, sections 32 and 34, in L4-style syntax</a></li>
<li><a href="#org4bfc1e9">3. Scenario</a>
<ul>
<li><a href="#orge977eb7">3.1. Part One</a></li>
<li><a href="#org77c73cc">3.2. Part Two</a></li>
<li><a href="#orgb3d5e03">3.3. The Rule Against Perpetuities</a></li>
<li><a href="#org5b02020">3.4. Part Three</a></li>
</ul>
</li>
<li><a href="#org4fbce49">4. Logics</a>
<ul>
<li><a href="#orgf3c431e">4.1. Defeasible</a></li>
<li><a href="#org65ab963">4.2. Temporal</a></li>
<li><a href="#org041490d">4.3. First Order</a></li>
<li><a href="#org9e68be5">4.4. Epistemic? Alethic?</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgbc0c088" class="outline-2">
<h2 id="orgbc0c088"><span class="section-number-2">1</span> Goals</h2>
<div class="outline-text-2" id="text-1">
<p>
introduce a variety of logics in which we can represent the RaP
</p>
</div>
</div>

<div id="outline-container-orgf870666" class="outline-2">
<h2 id="orgf870666"><span class="section-number-2">2</span> Represent the Civil Law Act, sections 32 and 34, in L4-style syntax</h2>
</div>

<div id="outline-container-org4bfc1e9" class="outline-2">
<h2 id="org4bfc1e9"><span class="section-number-2">3</span> Scenario</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orge977eb7" class="outline-3">
<h3 id="orge977eb7"><span class="section-number-3">3.1</span> Part One</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<i>We gather for the reading of the will of Queen Elizabeth II.</i>
</p>

<p>
Queen: I take great pleasure in my great-grandchildren.
</p>

<p>
I wish to give each one of them a small estate. I have so many.
</p>

<p>
At time of writing, Harry has two children (darling little Archie and Lilibet) and William has three (George, Charlotte, Louis).
</p>

<p>
I have set aside Estates E1, E2, E3, E4, and E5 for them, to be given to them when they reach the age of 21.
</p>

<p>
If any more children are born to Harry and to William, they too shall, at the age of 21, inherit estates E6, &#x2026; EN, up to N &lt;= 24, at which point I have run out of estates.
</p>

<p>
Lawyer: For tax reasons, let's model that inheritance gift as an option, where they have the right to purchase the estate for One Pound, when they reach age 21. Maybe they don't want to be saddled with the maintenance bills?
</p>
</div>
</div>

<div id="outline-container-org77c73cc" class="outline-3">
<h3 id="org77c73cc"><span class="section-number-3">3.2</span> Part Two</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Queen: Indeed, I wish for my great-grandchildren to themselves have the pleasure of great-grandchildren. So I will set aside estates for them: my great-great-great-great grand-children.
</p>
</div>
</div>

<div id="outline-container-orgb3d5e03" class="outline-3">
<h3 id="orgb3d5e03"><span class="section-number-3">3.3</span> The Rule Against Perpetuities</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Lawyer: But, Queen, some of those 24 estates cannot be given away! Why not? Because King Edward VII, over a hundred years ago, decided that he wanted some of those properties to be given to various great-great-great-grandchildren of his friends and family.
</p>

<p>
Queen: Well, that seems unnatural! I don't like that somebody who was King over a century ago could possibly tell me what to do with my estates.
</p>

<p>
Lawyer: Let us find some way to strike out that part of Edward VII's will. Please wait.
</p>

<p>
Lawyer: Processing.
</p>

<p>
Lawyer: Processing.
</p>

<p>
Lawyer: Found it! There is a thing called the Rule Against Perpetuities, that says, Edward VII cannot give away those properties to the great-great-great-grandchildren of his best hunting buddies, because, well, it was just too long ago. That's the rule.
</p>

<p>
Queen: Wait, what's the rule?
</p>

<p>
Lawyer: "Life in being plus 21 years".
</p>

<p>
Lee Kuan Yew: That rule is bloody confusing and in Singapore it is just 100 years after the death of the giver.
</p>

<p>
Queen: I like that.
</p>

<p>
Lawyer: Fine.
</p>
</div>
</div>

<div id="outline-container-org5b02020" class="outline-3">
<h3 id="org5b02020"><span class="section-number-3">3.4</span> Part Three</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Queen: OK, but that will apply to me, as well, won't it? I haven't lost all my marbles yet.
</p>

<p>
Lawyer: Yes. You can maybe give your estates away to people who are not born today but will exist 100 years from now. In fact we would like those people to have reached the age of 21, 100 years from now. So they need to be born 79 years from now.
</p>

<p>
Queen: Well. If George is 9 today, he could get married at, oh, 21?
</p>

<p>
And then his children, and his grand-children, each bear issue at 21, 
</p>

<p>
We're looking at 12+21+21+21 years which puts us under the 100 year limit. So that could be a thing, yah?
</p>

<p>
Lawyer: Yes, but what if everybody waits until 30 to have kids? Then cannot liao.
</p>
</div>
</div>
</div>


<div id="outline-container-org4fbce49" class="outline-2">
<h2 id="org4fbce49"><span class="section-number-2">4</span> Logics</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgf3c431e" class="outline-3">
<h3 id="orgf3c431e"><span class="section-number-3">4.1</span> Defeasible</h3>
</div>

<div id="outline-container-org65ab963" class="outline-3">
<h3 id="org65ab963"><span class="section-number-3">4.2</span> Temporal</h3>
</div>

<div id="outline-container-org041490d" class="outline-3">
<h3 id="org041490d"><span class="section-number-3">4.3</span> First Order</h3>
</div>

<div id="outline-container-org9e68be5" class="outline-3">
<h3 id="org9e68be5"><span class="section-number-3">4.4</span> Epistemic? Alethic?</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Wong Meng Weng</p>
<p class="date">Created: 2022-09-29 Thu 15:37</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
